package SergeQA.homework.lesson10;

/*
Логика алгоритмов:
1. Считать string. Вырезать пробелы. Преобразовать ее в массив char'ов. Перевести массив в строку, начиная с конца.
Сравнить получившуюся строку со считанной без пробелов. Если равны - вывести результат "String is palindrome"
2. Считать String. Вырезать пробелы. Преобразовать в массив char'ов. Сравнить первый и последний элементы массива,
второй и предпоследний и т.д. - и так до середины массива. Если длина массива нечетная, средний символ не сравнивается.
3. Считать String. Вырезать пробелы. Преобразовать в массив char'ов. Расположить элементы массива в обратном порядке.
Преобразовать массив в строку. Сравнить с исходной строкой без пробелов.
4. Считать String. Вырезать пробелы. Преобразовать в массив char'ов. Создать второй массив, одинаковый с первым. Во втором массиве
расположить элементы в обратном порядке. Сравнить первый элемент первого массива с последним элементом второго массива,
второй элемент первого массива с предпоследним элементом второго массива и т.д. до конца обоих массивов. Если находтся элементы, которые не равны -
break и вывод результата "String is not palindrome". Если неравные элементы не находятся - вывод результата "String is palindrome".
 */
public class IsStringPalindrome {
}
